/**************************************************************************//*!
 *  @file           hal_cmn_gpio.c
 *  @brief          [HAL] GPIO の共通 API を定義したファイル。
 *  @author         Ryoji Morita
 *  @attention      none.
 *  @sa             none.
 *  @bug            none.
 *  @warning        none.
 *  @version        1.00
 *  @last updated   2016.06.05
 *************************************************************************** */
#ifdef __cplusplus
    extern "C"{
#endif


//********************************************************
/* include                                               */
//********************************************************
#include <wiringPi.h>

#include "hal_cmn.h"


//#define DBG_PRINT
#define MY_NAME "HAL"
#include "../app/log/log.h"


//********************************************************
/*! @def                                                 */
//********************************************************
// なし


//********************************************************
/*! @enum                                                */
//********************************************************
// なし


//********************************************************
/*! @struct                                              */
//********************************************************
// なし


//********************************************************
/* モジュールグローバル変数                              */
//********************************************************
// なし


//********************************************************
/* 関数プロトタイプ宣言                                  */
//********************************************************
static void         InitParam( void );
static EHalBool_t   InitReg( void );




/**************************************************************************//*!
 * @brief     ファイルスコープ内のグローバル変数を初期化する。
 * @attention なし。
 * @note      なし。
 * @sa        なし。
 * @author    Ryoji Morita
 * @return    なし。
 *************************************************************************** */
static void
InitParam(
    void  ///< [in] ナシ
){
    DBG_PRINT_TRACE( "\n\r" );
    return;
}


/**************************************************************************//*!
 * @brief     H/W レジスタを初期化する。
 * @attention なし。
 * @note      なし。
 * @sa        なし。
 * @author    Ryoji Morita
 * @return    EN_TRUE : 成功, EN_FALSE : 失敗
 *************************************************************************** */
static EHalBool_t
InitReg(
    void  ///< [in] ナシ
){
    EHalBool_t      ret = EN_FALSE;
    int             res = 0;

    DBG_PRINT_TRACE( "\n\r" );

    res = wiringPiSetupGpio();
    if( res != -1 )
    {
        ret = EN_TRUE;
    }

    return ret;
}


/**************************************************************************//*!
 * @brief     GPIO 設定レジスタへアクセスするためにメモリアドレスを mmap する。
 * @attention なし。
 * @note      mmap で GPIO(物理メモリ) を gpio->map(仮想メモリ) に対応づける。
 * @sa        なし。
 * @author    Ryoji Morita
 * @return    EN_TRUE : 成功, EN_FALSE : 失敗
 *************************************************************************** */
EHalBool_t
HalCmnGpio_Init(
    void
){
    EHalBool_t      ret = EN_FALSE;

    DBG_PRINT_TRACE( "\n\r" );

    InitParam();
    ret = InitReg();

    return ret;
}


/**************************************************************************//*!
 * @brief     GPIO レジスタのメモリアドレスを munmap する。
 * @attention なし。
 * @note      OpenGPIO() で呼んだ open()/mmap() を munmap()/close() する。
 * @sa        なし。
 * @author    Ryoji Morita
 * @return    なし。
 *************************************************************************** */
void
HalCmnGpio_Fini(
    void
){
    DBG_PRINT_TRACE( "\n\r" );
    return;
}


#ifdef __cplusplus
    }
#endif

