/**************************************************************************//*!
 *  @file           if_pc.c
 *  @brief          [APP] PC のターミナルに文字を UART 送信/受信する。
 *  @author         Ryoji Morita
 *  @attention      none.
 *  @sa             none.
 *  @bug            none.
 *  @warning        none.
 *  @version        1.00
 *  @last updated   2016.07.01
 *************************************************************************** */
#ifdef __cplusplus
    extern "C"{
#endif


//********************************************************
/* include                                               */
//********************************************************
#include <stdarg.h>
#include <string.h>
#include <stdio.h>

#include "if_pc.h"

//#define DBG_PRINT
#define MY_NAME "APP"
#include "../log/log.h"


//********************************************************
/*! @def                                                 */
//********************************************************
// なし


//********************************************************
/*! @enum                                                */
//********************************************************
// なし


//********************************************************
/*! @struct                                              */
//********************************************************
// なし


//********************************************************
/* モジュールグローバル変数                              */
//********************************************************
// なし


//********************************************************
/* 関数プロトタイプ宣言                                  */
//********************************************************
// なし




/**************************************************************************//*!
 * @brief     PC ターミナルへ 1 文字を出力する。
 * @attention なし。
 * @note      なし。
 * @sa        なし。
 * @author    Ryoji Morita
 * @return    成功時 = 出力した 1 文字 , 失敗時 = EOF
 *************************************************************************** */
int
AppIfPc_Putc(
    int             c   ///< [in] 送信する 1 文字
){
    DBG_PRINT_TRACE( "\n\r" );
    return putchar( c );
}


/**************************************************************************//*!
 * @brief     PC ターミナルへ文字列を出力する。
 * @attention なし。
 * @note      なし。
 * @sa        なし。
 * @author    Ryoji Morita
 * @return    成功時 = 出力した文字数 , 失敗時 = EOF
 *************************************************************************** */
int
AppIfPc_Puts(
    const char*     str     ///< [in] 送信する文字列
){
    DBG_PRINT_TRACE( "\n\r" );
    return puts( str );
}


/**************************************************************************//*!
 * @brief     PC ターミナルへ文字列を printf() 関数フォーマットのように出力する。
 * @attention 浮動小数点関係は、未実装。
 * @note      なし。
 * @sa        なし。
 * @author    Ryoji Morita
 * @return    成功時 = 出力した文字数 , 失敗時 = -1
 *************************************************************************** */
int
AppIfPc_Printf(
    const char*     format, ///< [in] 送信する文字列
    ...                     ///< [in] 可変個数引数
){
    int             ret = 0;
    va_list         list;

    DBG_PRINT_TRACE( "\n\r" );

    va_start( list, format );
    ret = vprintf( format, list );
    va_end( list );

    return ret;
}


/**************************************************************************//*!
 * @brief     PC ターミナルから 1 文字を入力する。
 * @attention なし。
 * @note      なし。
 * @sa        なし。
 * @author    Ryoji Morita
 * @return    成功時 = 入力した 1 文字 , 失敗時 = -1 (= EOF )
 *************************************************************************** */
int
AppIfPc_Getc(
    void
){
    DBG_PRINT_TRACE( "\n\r" );

    return getchar();
}


/**************************************************************************//*!
 * @brief     PC ターミナルから文字列を scanf() 関数フォーマットのように入力する。
 * @attention なし。
 * @note      なし。
 * @sa        なし。
 * @author    Ryoji Morita
 * @return    成功時 = 入力した文字数 , 失敗時 = -1 (= EOF )
 *************************************************************************** */
int
AppIfPc_Scanf(
    const char*     format,     ///< [in] 受信する文字列をセットする変数
    ...                         ///< [in] 可変個数引数
){
    int             ret = 0;
    va_list         list;

    DBG_PRINT_TRACE( "\n\r" );

    va_start( list, format );
    ret = vscanf( format, list );
    va_end( list );

    return ret;
}


#ifdef __cplusplus
    }
#endif

